[
  {
    "from": "March 2022",
    "to": "October 2024",
    "employer": "Toptal",
    "location": "Remote",
    "role": "Senior Front-End Engineer",
    "projects": [
      {
        "name": "Client Portal: Talent Insights (Initiative Lead)",
        "description": "Led the Talent Insights initiative, a year-long phased project focused on streamlining the interview process and enhancing data visibility. Coordinated team efforts and utilized Jira for task tracking and project management. Successfully rolled out new features using feature toggles, enabling a phased approach to project delivery.",
        "tech": [
          "React",
          "TypeScript",
          "SASS",
          "Jest (React Testing Library)",
          "Cypress (Component Tests)",
          "Storybook (Visual Tests and Documentation)"
        ]
      },
      {
        "name": "Client Portal",
        "description": "Contributed to the development of Client Portal, a platform used by Clients to create Jobs, review Talent, and schedule interviews. As part of the Matching team, I was responsible for developing and maintaining features related to creating Jobs and displaying Talent profiles. I collaborated with cross-functional teams to ensure seamless integration and functionality, and I also analyzed and troubleshot issues to improve the overall user experience.",
        "tech": [
          "React",
          "TypeScript",
          "SASS",
          "Jest (React Testing Library)",
          "Cypress (Component Tests)",
          "Storybook (Visual Tests and Documentation)"
        ]
      },
      {
        "name": "Staff Portal: Pricing Calculator (Initiative Lead)",
        "description": "Led the Pricing Calculator initiative, a project focused on providing clients with accurate and detailed pricing information for specific talent. Successfully integrated the calculator into an internal tool, enhancing the efficiency of the hiring process and improving client satisfaction.",
        "tech": [
          "React",
          "TypeScript",
          "Material UI",
          "Jest (React Testing Library)",
          "Cypress (Component Tests)",
          "Storybook (Visual Tests and Documentation)"
        ]
      },
      {
        "name": "Staff Portal: Rates Calculator (Initiative Lead)",
        "description": "Led the Rates Calculator initiative, a project focused on improving the accuracy and efficiency of pricing calculations within Staff Portal when sending potential candidates to clients for posted jobs. Successfully migrated client-side calculations to the backend, enabling real-time updates and ensuring accurate pricing based on dynamic rate changes.",
        "tech": [
          "React",
          "TypeScript",
          "Material UI",
          "Jest (React Testing Library)",
          "Cypress (Component Tests)",
          "Storybook (Visual Tests and Documentation)"
        ]
      },
      {
        "name": "Staff Portal",
        "description": "Contributed to the development of Staff Portal, an internal software platform used to manage Clients, Talent, and Staff within Toptal. As part of the Matching team, I was responsible for developing and maintaining features related to matching Talent with Clients and sending Talent to Jobs.",
        "tech": [
          "React",
          "TypeScript",
          "Material UI",
          "Jest (React Testing Library)",
          "Cypress (Component Tests)",
          "Storybook (Visual Tests and Documentation)"
        ]
      }
    ]
  },
  {
    "from": "June 2020",
    "to": "March 2022",
    "employer": "Incon Health",
    "location": "Remote",
    "role": "Freelance Software Engineer",
    "projects": [
      {
        "name": "Performer Plus",
        "description": "Developed Performer Plus, a software platform designed to assist employers in managing workplace risks, injuries, and diseases. As the sole front-end developer, I was responsible for building the user interface from scratch. I also contributed to the back-end development and helped plan the overall architecture of the application.",
        "tech": [
          "React",
          "TypeScript",
          "Chakra UI",
          ".NET 6",
          "MS SQL Server"
        ]
      },
      {
        "name": "COVIDCare",
        "description": "Developed COVIDCare, a software platform designed to assist employers in managing COVID-19 cases within the workplace. As part of the development team, I was responsible for building the platform from the ground up, including features related to tracking COVID-19 cases, submitting data to the Department of Health, and integrating with the Screening PWA, a mobile application used by employees to report potential COVID-19 symptoms.",
        "tech": [
          "React",
          "TypeScript",
          "Semantic UI",
          ".NET Core",
          "MS SQL Server"
        ]
      },
      {
        "name": "COVIDCare Screening PWA",
        "description": "Developed Screening PWA, a mobile application designed for the occupational health industry. As part of the development team, I was responsible for building the application from the ground up, enabling employees to self-screen for COVID-19 on a daily basis. The PWA integrated seamlessly with COVIDCare, a platform used by employers to manage COVID-19 cases within the workplace.",
        "tech": [
          "React",
          "TypeScript",
          "SCSS",
          ".NET Core",
          "MS SQL Server"
        ]
      }
    ]
  },
  {
    "from": "Sept 2018",
    "to": "June 2020",
    "employer": "Leadhome",
    "location": "Remote",
    "role": "Software Engineer",
    "projects": [
      {
        "name": "Book a Viewing",
        "description": "Developed the Viewing Booking Wizard at Leadhome, a tech startup in the South African real estate industry. As part of the development team, I was responsible for implementing the user interface from Figma designs and building features related to booking viewings for properties listed on the Leadhome platform. My contributions helped to streamline the viewing process for both agents and clients.",
        "tech": [
          "React",
          "Redux",
          "Styled Components",
          "Cypress (E2E)"
        ]
      },
      {
        "name": "leadhome.co.za - Estate Agents",
        "description": "Developed the Estate Agents section of the Leadhome website, a new micro UI designed to enhance organic traffic through SEO optimization. The project involved creating a user-friendly interface for finding Leadhome estate agents by province, metro, and suburb, as well as developing a back-end API to integrate with our microservices and migrate estate agent data from WordPress to our internal CRM.",
        "tech": [
          "React",
          "Styled Components",
          ".NET Core",
          "GraphQL",
          "PostgreSQL"
        ]
      },
      {
        "name": "leadhome.co.za",
        "description": "Contributed to a partial rebuild of the Leadhome website, maintaining the older version while using Nginx to proxy requests to either application, ensuring a seamless user experience without changing the domain. This project involved updating key sections of the website to improve functionality and user experience.",
        "tech": [
          "React",
          "Styled Components",
          "nginx",
          "NextJS"
        ]
      },
      {
        "name": "Book a Valuation",
        "description": "Developed the \"Book a Valuation\" wizard for the Leadhome website, a tool that allows homeowners to easily schedule property valuations. The project involved designing and implementing a user-friendly interface, integrating with the Leadhome platform, and ensuring a seamless booking process.",
        "tech": [
          "React",
          "Redux",
          "Styled Components",
          "Cypress (E2E)"
        ]
      },
      {
        "name": "Carbon",
        "link": "https://github.com/leadhomesa/carbon",
        "description": "Proposed and led the development of Carbon, an open-source PWA boilerplate designed for internal React front-ends at Leadhome. As the project lead, I was responsible for defining the project's scope, architecture, and development process. I also contributed significantly to the development of the boilerplate, including its core features, documentation, and maintenance.",
        "tech": [
          "React",
          "Webpack",
          "Styled Components"
        ]
      },
      {
        "name": "Osmosis - Internal CRM",
        "description": "Developed Osmosis, an internal CRM built to replace Salesforce at Leadhome. As a back-end developer, I contributed significantly to the development of the GraphQL API using .NET Core. I also worked on other microservices that communicated via REST and RabbitMQ, playing a key role in the overall architecture and implementation of the CRM.",
        "tech": [
          ".NET Core",
          "GraphQL",
          "PostgreSQL",
          "RabbitMQ"
        ]
      }
    ]
  },
  {
    "from": "Jan 2017",
    "to": "Aug 2018",
    "employer": "MADE",
    "location": "Cape Town",
    "role": "Software Engineer",
    "projects": [
      {
        "name": "made.co.za",
        "description": "MADE Agency website. (Now changed)",
        "tech": [
          "React",
          "Node",
          "RxJS",
          "Styled Components"
        ]
      },
      {
        "name": "Lobbsta",
        "description": "Front-end development of an online e-sports platform to schedule, share and view real-time stats of Dota 2 matches.",
        "tech": [
          "React",
          "Redux",
          "RxJS",
          "SCSS"
        ]
      },
      {
        "name": "Concierge",
        "description": "The Concierge app works in conjunction with its software platform to allow for easy, on-the-go management of its events and guests.",
        "tech": [
          "Node",
          "Angular",
          "MongoDB",
          "SCSS"
        ]
      },
      {
        "name": "XLR",
        "link": "https://github.com/madeagency/xlr",
        "description": "Open source MS Excel spreadsheet generator built for NodeJS and used in Concierge.",
        "tech": [
          "Node"
        ]
      }
    ]
  },
  {
    "from": "Sept 2016",
    "to": "Dec 2016",
    "employer": "Cape Networks",
    "location": "Cape Town and Remote",
    "role": "Front-End Developer",
    "projects": [
      {
        "name": "Cape Networks (now Aruba) Dashboard",
        "description": "Front-end development of the dashboard allowing users to troubleshoot Wi-Fi and improve quality remotely.",
        "tech": [
          "React",
          "Redux",
          "Firebase",
          "SCSS"
        ]
      }
    ]
  },
  {
    "from": "June 2015",
    "to": "Aug 2016",
    "employer": "Wetu",
    "location": "Cape Town",
    "role": "Software Engineer",
    "projects": [
      {
        "name": "wetu.com",
        "description": "Wetu public facing website.",
        "tech": [
          "ASP.NET MVC",
          "SCSS"
        ]
      },
      {
        "name": "Mobile Itinerary SPA",
        "description": "SPA which allows clients to view their travel itineraries on mobile.",
        "tech": [
          "ASP.NET MVC",
          "JavaScript",
          "SCSS"
        ]
      },
      {
        "name": "Specials Portal",
        "description": "Allow clients to create special offers linked to their accommodations listed with Wetu. Clients can search for specials created using the specials search portal",
        "tech": [
          "ASP.NET MVC",
          "JavaScript",
          "MS SQL Server",
          "RavenDB",
          "SCSS"
        ]
      },
      {
        "name": "Internal Metrics Dashboard",
        "description": "Dashboard built with D3.js to view internal metrics.",
        "tech": [
          "ASP.NET MVC",
          "JavaScript",
          "MS SQL Server",
          "RavenDB",
          "SCSS"
        ]
      }
    ]
  },
  {
    "from": "March 2013",
    "to": "May 2015",
    "employer": "Intervate",
    "location": "Cape Town and Remote",
    "role": "Junior Tech Consultant",
    "projects": [
      {
        "name": "Citizen Reporting (Formerly FixMyCity)",
        "description": "Reusable mobile app framework and web dashboards",
        "tech": [
          "Windows Phone",
          "ASP.NET",
          "Azure",
          "MSSQL Azure"
        ]
      },
      {
        "name": "JRA Find & Fix",
        "description": "Windows Phone app and REST api which enables citizens of Johannesburg to report road issues to the Johannesburg Road Agency.",
        "tech": [
          "Windows Phone",
          "ASP.NET",
          "Azure",
          "MSSQL Azure"
        ]
      },
      {
        "name": "Citizen Scientist",
        "description": "Windows Phone app and REST api which enables individuals to capture animal sightings and assist in tracking of endangered animals.",
        "tech": [
          "Windows Phone",
          "ASP.NET",
          "Azure",
          "MSSQL Azure"
        ]
      }
    ]
  }
]
